Autodesk.Revit.DB.SolidOptions.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new SolidOptions class.
materialId:
The material id for the Solid.
graphicsStyleId:
The graphics style id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015